# KeyBasedTreeEntries Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntries Class
Members See Also
---
A collection of KeyBasedTreeEntry objects that make up the key-based tree.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class KeyBasedTreeEntries : IEnumerable<KeyBasedTreeEntry>,
	IDisposable
```

Visual Basic
---
```text
Public Class KeyBasedTreeEntries _
	Implements IEnumerable(Of KeyBasedTreeEntry), IDisposable
```

Visual C++
---
```text
public ref class KeyBasedTreeEntries : IEnumerable<KeyBasedTreeEntry^>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..KeyBasedTreeEntries Autodesk.Revit.DB..::..ClassificationEntries Autodesk.Revit.DB..::..KeynoteEntries
# See Also
KeyBasedTreeEntries Members
Autodesk.Revit.DB Namespace